In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)

In [3]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [4]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [5]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [6]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [7]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [8]:
df1.shape

(7, 4)

In [9]:
print("Number of Rows:",df1.shape[0])
print("Number of Columns:",df1.shape[1])

Number of Rows: 7
Number of Columns: 4

In [10]:
#panda series
df1.Marks

0    98.0
1     NaN
2    99.0
3    87.0
4     NaN
5    83.0
6    99.0
Name: Marks, dtype: float64

In [11]:
df1['Marks'].shape

(7,)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [13]:
df1.isnull()

    Name  Marks  Gender  Email
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False
5  False  False   False  False
6  False  False   False  False

In [14]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [15]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [16]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [17]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [18]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [19]:
df1['Gender'].nunique()

2

In [20]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [21]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [22]:
df1.dropna()

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [23]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [24]:
df1.fillna(0)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [25]:
df1['Marks'] = df1['Marks'].fillna(df1['Marks'].mean())

In [26]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [27]:
sum((df1['Marks'] >= 80) & (df1['Marks'] <= 90))

2

In [28]:
sum(df1['Marks']. between(80,90))

2

In [29]:
df1['Marks'].min()

83.0

In [30]:
df1['Marks'].min() == df1['Marks']

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: Marks, dtype: bool

In [31]:
df1[df1['Marks'].min() == df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [32]:
df1.nlargest(5,'Marks')['Name']

2     Krisha
6    Archana
0    Priyang
1     Aadhya
4     Parshv
Name: Name, dtype: object

In [33]:
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [34]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
5   Mittal   83.0  Female    mittal@yahoo.com

In [35]:
df1.sort_values(by='Marks',ascending=False).head()

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com

In [36]:
# Sort with ma
df1.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [62]:
# To find mean, min and max of the marks colums
df1['Marks'].mean()

93.2

In [38]:
df1['Marks'].min()

83.0

In [39]:
df1['Marks'].max()

99.0

In [60]:
# Use python method to find half of marks columns
def marks(x):
    return x//2

In [61]:
# Create a new column with the half percentage mark created
df1['Half_marks']=df1['Marks'].apply(marks)

In [44]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.0
2   Krisha   99.0  Female    krisha@gmail.com        49.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.0
5   Mittal   83.0  Female    mittal@yahoo.com        41.0
6  Archana   99.0  Female   archana@yahoo.com        49.0

In [57]:
# Rename male as (1) Female as (0)
df1['Male_Female'] = df1['Gender'].map({'Male':1,'Female':0})

In [47]:
df1

      Name  Marks  Gender               Email  Half_marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.0            0
2   Krisha   99.0  Female    krisha@gmail.com        49.0            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.0            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.0            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.0            0
6  Archana   99.0  Female   archana@yahoo.com        49.0            0

In [58]:
# Drop a column with inplace method
df1.drop('Male_Female',axis=1,inplace=True)

In [49]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.0
2   Krisha   99.0  Female    krisha@gmail.com        49.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.0
5   Mittal   83.0  Female    mittal@yahoo.com        41.0
6  Archana   99.0  Female   archana@yahoo.com        49.0

In [55]:
# Sort name and marks by female gender
df1[df1['Gender'] =='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [56]:
# Second method
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [54]:
# rename a column
df1.rename(columns={'Marks':"Final_Marks"})

      Name  Final_Marks  Gender               Email  Half_marks
0  Priyang         98.0    Male   priyang@gmail.com        49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.0
2   Krisha         99.0  Female    krisha@gmail.com        49.0
3   Vedant         87.0    Male    vedant@yahoo.com        43.0
4   Parshv         93.2    Male  parshv@hotmail.com        46.0
5   Mittal         83.0  Female    mittal@yahoo.com        41.0
6  Archana         99.0  Female   archana@yahoo.com        49.0

In [ ]:
df